study/nodejs/nodejs.org
** Question 4
+ Q：如何定义字典呢？
+ A:
#+BEGIN_EXAMPLE
1 javascript的object就是一个字典

2 mymap = {}

3 如何获取某个键的值

4 如何修改某个键的值

5 如何追加一个新的键

6 如何遍历

#+END_EXAMPLE

#+BEGIN_EXAMPLE
// 004.js

mymap = {
    "id": 10001,
    "name": "abb"
};

var id_value = mymap['id'];
var name_value = mymap['name'];
console.log("---------------------------------");
console.log(mymap);
console.log(id_value);
console.log(name_value);

console.log("---------------------------------");
mymap['id'] = '20001';
console.log(mymap);
console.log("---------------------------------");

mymap['city'] = 'nanjing';
console.log(mymap);
console.log("---------------------------------");
#+END_EXAMPLE

#+BEGIN_EXAMPLE
c/P/l/s/j/nodejs/example:master*? λ node 004.js
---------------------------------
{ id: 10001, name: 'abb' }
10001
abb
---------------------------------
{ id: '20001', name: 'abb' }
---------------------------------
{ id: '20001', name: 'abb', city: 'nanjing' }
---------------------------------
c/P/l/s/j/nodejs/example:master*? λ 

#+END_EXAMPLE

** Question 5
+ Q 5.1：如何定义函数呢？
+ A:
#+BEGIN_EXAMPLE
1 function 函数名(参数1, 参数2)
function print_log(args1, args2) {
}
#+END_EXAMPLE

+ Q 5.2：有匿名函数吗？
#+BEGIN_EXAMPLE
有
#+END_EXAMPLE

+ Q 5.3：函数的参数可以再是函数吗？
#+BEGIN_EXAMPLE
可以
语言级别中已经实现了map,filter这种思想的函数了
#+END_EXAMPLE

#+BEGIN_EXAMPLE
// 005.js

/******************************************************************************/
function print_log(level, msg) {
    if (level == "ERRO") {
        console.log("\033[31m[" + level + "]\033[0m" + msg);
    } else if (level == "INFO") {
        console.log("\033[32m[" + level + "]\033[0m" + msg);
    } else if (level == "WARN") {
        console.log("\033[33m[" + level + "]\033[0m" + msg);
    }
}
/******************************************************************************/
function main() {
    print_log("ERRO", 'This is ERRO test.');
    print_log("INFO", 'This is INFO test.');
    print_log("WARN", 'This is WARN test.');
}
/******************************************************************************/
main();
#+END_EXAMPLE
#+BEGIN_EXAMPLE
c/P/l/s/j/nodejs/example:master*? λ node 005.js 
[ERRO]This is ERRO test.
[INFO]This is INFO test.
[WARN]This is WARN test.
c/P/l/s/j/nodejs/example:master*? λ 
#+END_EXAMPLE

** Question 6
+ Q: 如何导入其它js文件中的函数呢？
+ A:
#+BEGIN_EXAMPLE
// lib.js
module.exports = {
    funname1: function(arg1, arg2) {
    // do something
    },
    funname2: function(arg1, arg2) {
    // do something
    }
};

// 006.js
var libfun = require("./lib.js");
#+END_EXAMPLE
#+BEGIN_EXAMPLE
// lib.js
/******************************************************************************/
module.exports = {

    print_log: function(level, msg) {
        if (level == "ERRO") {
            console.log("\033[31m[" + level + "]\033[0m" + msg);
        } else if (level == "INFO") {
            console.log("\033[32m[" + level + "]\033[0m" + msg);
        } else if (level == "WARN") {
            console.log("\033[33m[" + level + "]\033[0m" + msg);
        }
    },

    print_log2: function(level, msg) {
        if (level == "ERRO") {
            console.log("\033[31m[" + level + "]\033[0m" + msg);
        } else if (level == "INFO") {
            console.log("\033[32m[" + level + "]\033[0m" + msg);
        } else if (level == "WARN") {
            console.log("\033[33m[" + level + "]\033[0m" + msg);
        }
    }

};
/******************************************************************************/

// 006.js

var libfun = require("./lib.js");
libfun.print_log("INFO", "print_log function from lib.js");
#+END_EXAMPLE

#+BEGIN_EXAMPLE
c/P/l/study/nodejs/example:master*? λ node.exe 006.js 
[INFO]print_log function from lib.js
c/P/l/study/nodejs/example:master*? λ 
#+END_EXAMPLE

** Question 7
+ Q 7.1: node.js面向对象的特性呢？
+ A:
#+BEGIN_EXAMPLE
可以定义一个结构体
#+END_EXAMPLE

+ Q 7.2: 那结构体可以定义成员方法吗？
+ A:
#+BEGIN_EXAMPLE
可以
#+END_EXAMPLE

+ Q 7.3: 那结构体可以继承吗？
#+BEGIN_EXAMPLE
可以用组合的方式
#+END_EXAMPLE

** Question 8
+ Q: node.js如何实现异步呢？
+ A:
#+BEGIN_EXAMPLE
1 采用回调函数

#+END_EXAMPLE

#+BEGIN_EXAMPLE
2 采用async可以做到用同步的写法实现异步的功能
#+END_EXAMPLE

** Question 9
+ Q: node.js事件驱动
+ A:
#+BEGIN_EXAMPLE
消息名(相当于通道)
向一个消息名里抛出消息 emit
从一个消息名里监听消息 once （多种模式）
#+END_EXAMPLE
** Question 10
+ Q: node.js的web后端开发
+ A:
#+BEGIN_EXAMPLE
学习相关的三方库
http
file
mysql,postgresql
mongodb
#+END_EXAMPLE


* es6
#+BEGIN_EXAMPLE
ECMAScript语言规范第6版，规范编写JS代码的方式！
#+END_EXAMPLE
** let 和 const
+ let
#+BEGIN_EXAMPLE
let定义一个变量，并且定义的变量为块级作用域
#+END_EXAMPLE

+ const
#+BEGIN_EXAMPLE
const定义一个常量
#+END_EXAMPLE

#+BEGIN_EXAMPLE
// es6_001.js

const pi = 3.1415926;
for (let i = 0; i < 2; i++) {
    console.log("this is for loop i: ", i);
}

console.log("pi: ", pi);

// let声明的i，只是在for作用域中，这里没有定义的变量i报错
console.log("this is not for loop i: ", i); 
#+END_EXAMPLE

#+BEGIN_EXAMPLE
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_001.js 
this is for loop i:  0
this is for loop i:  1
pi:  3.1415926
c:\Projects\lescpsn\study\javascript\nodejs\es6\es6_001.js:9
console.log("this is not for loop i: ", i); 
                                        ^

ReferenceError: i is not defined
#+END_EXAMPLE

** for of 直接遍历数组的值
#+BEGIN_EXAMPLE
let myArry = ['a', 'ab', "b", "bc"];

for (let v of myArry) {
    console.log(v);
}
#+END_EXAMPLE

#+BEGIN_EXAMPLE
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_002.js 
a
ab
b
bc
c/P/l/s/javascript/nodejs/es6:master*? λ 
#+END_EXAMPLE

** 函数定义
 #+BEGIN_EXAMPLE
 getName: function(name)  ==>     getName(name) 
 #+END_EXAMPLE

#+BEGIN_EXAMPLE
// es6_003.js

var human = {
    getName(name) { // getName: function(name)
        console.log("my name is: ", name);
    }
};
human.getName('abb');
#+END_EXAMPLE
#+BEGIN_EXAMPLE
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_003.js 
my name is:  abb
c/P/l/s/javascript/nodejs/es6:master*? λ 
#+END_EXAMPLE

** 类定义（class）
#+BEGIN_EXAMPLE
// es6_004.js

class Human {
    constructor(name) {  // 相当于构造函数
        this.name = name;
    }
    getName(){
        console.log("my name is:",this.name);
    }
}
var man = new Human('bccc');
man.getName();
#+END_EXAMPLE
#+BEGIN_EXAMPLE
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe es6_004.js 
my name is: bccc
c/P/l/s/javascript/nodejs/es6:master*? λ 

#+END_EXAMPLE

