study/nodejs/nodejs.html

<div id="outline-container-orgb63b698" class="outline-3">
<h3 id="orgb63b698"><span class="section-number-3">2.4</span> Question 4</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Q：如何定义字典呢？</li>
<li>A:</li>
</ul>
<pre class="example">
1 javascript的object就是一个字典

2 mymap = {}

3 如何获取某个键的值

4 如何修改某个键的值

5 如何追加一个新的键

6 如何遍历
</pre>

<pre class="example">
// 004.js

mymap = {
    "id": 10001,
    "name": "abb"
};

var id_value = mymap['id'];
var name_value = mymap['name'];
console.log("---------------------------------");
console.log(mymap);
console.log(id_value);
console.log(name_value);

console.log("---------------------------------");
mymap['id'] = '20001';
console.log(mymap);
console.log("---------------------------------");

mymap['city'] = 'nanjing';
console.log(mymap);
console.log("---------------------------------");
</pre>

<pre class="example">
c/P/l/s/j/nodejs/example:master*? λ node 004.js
---------------------------------
{ id: 10001, name: 'abb' }
10001
abb
---------------------------------
{ id: '20001', name: 'abb' }
---------------------------------
{ id: '20001', name: 'abb', city: 'nanjing' }
---------------------------------
c/P/l/s/j/nodejs/example:master*? λ
</pre>
</div>
</div>

<div id="outline-container-org2e6a19c" class="outline-3">
<h3 id="org2e6a19c"><span class="section-number-3">2.5</span> Question 5</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Q 5.1：如何定义函数呢？</li>
<li>A:</li>
</ul>
<pre class="example">
1 function 函数名(参数1, 参数2)
function print_log(args1, args2) {
}
</pre>

<ul class="org-ul">
<li>Q 5.2：有匿名函数吗？</li>
</ul>
<pre class="example">
有
</pre>

<ul class="org-ul">
<li>Q 5.3：函数的参数可以再是函数吗？</li>
</ul>
<pre class="example">
可以
语言级别中已经实现了map,filter这种思想的函数了
</pre>

<pre class="example">
// 005.js

/******************************************************************************/
function print_log(level, msg) {
    if (level == "ERRO") {
        console.log("\033[31m[" + level + "]\033[0m" + msg);
    } else if (level == "INFO") {
        console.log("\033[32m[" + level + "]\033[0m" + msg);
    } else if (level == "WARN") {
        console.log("\033[33m[" + level + "]\033[0m" + msg);
    }
}
/******************************************************************************/
function main() {
    print_log("ERRO", 'This is ERRO test.');
    print_log("INFO", 'This is INFO test.');
    print_log("WARN", 'This is WARN test.');
}
/******************************************************************************/
main();
</pre>
<pre class="example">
c/P/l/s/j/nodejs/example:master*? λ node 005.js 
[ERRO]This is ERRO test.
[INFO]This is INFO test.
[WARN]This is WARN test.
c/P/l/s/j/nodejs/example:master*? λ
</pre>
</div>
</div>

<div id="outline-container-org2062c98" class="outline-3">
<h3 id="org2062c98"><span class="section-number-3">2.6</span> Question 6</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Q: 如何导入其它js文件中的函数呢？</li>
<li>A:</li>
</ul>
<pre class="example">
// lib.js
module.exports = {
    funname1: function(arg1, arg2) {
    // do something
    },
    funname2: function(arg1, arg2) {
    // do something
    }
};

// 006.js
var libfun = require("./lib.js");
</pre>
<pre class="example">
// lib.js
/******************************************************************************/
module.exports = {

    print_log: function(level, msg) {
        if (level == "ERRO") {
            console.log("\033[31m[" + level + "]\033[0m" + msg);
        } else if (level == "INFO") {
            console.log("\033[32m[" + level + "]\033[0m" + msg);
        } else if (level == "WARN") {
            console.log("\033[33m[" + level + "]\033[0m" + msg);
        }
    },

    print_log2: function(level, msg) {
        if (level == "ERRO") {
            console.log("\033[31m[" + level + "]\033[0m" + msg);
        } else if (level == "INFO") {
            console.log("\033[32m[" + level + "]\033[0m" + msg);
        } else if (level == "WARN") {
            console.log("\033[33m[" + level + "]\033[0m" + msg);
        }
    }

};
/******************************************************************************/

// 006.js

var libfun = require("./lib.js");
libfun.print_log("INFO", "print_log function from lib.js");
</pre>

<pre class="example">
c/P/l/study/nodejs/example:master*? λ node.exe 006.js 
[INFO]print_log function from lib.js
c/P/l/study/nodejs/example:master*? λ
</pre>
</div>
</div>

<div id="outline-container-orgf3ba3d1" class="outline-3">
<h3 id="orgf3ba3d1"><span class="section-number-3">2.7</span> Question 7</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>Q 7.1: node.js面向对象的特性呢？</li>
<li>A:</li>
</ul>
<pre class="example">
可以定义一个结构体
</pre>

<ul class="org-ul">
<li>Q 7.2: 那结构体可以定义成员方法吗？</li>
<li>A:</li>
</ul>
<pre class="example">
可以
</pre>

<ul class="org-ul">
<li>Q 7.3: 那结构体可以继承吗？</li>
</ul>
<pre class="example">
可以用组合的方式
</pre>
</div>
</div>

<div id="outline-container-org23c4373" class="outline-3">
<h3 id="org23c4373"><span class="section-number-3">2.8</span> Question 8</h3>
<div class="outline-text-3" id="text-2-8">
<ul class="org-ul">
<li>Q: node.js如何实现异步呢？</li>
<li>A:</li>
</ul>
<pre class="example">
1 采用回调函数
</pre>

<pre class="example">
2 采用async可以做到用同步的写法实现异步的功能
</pre>
</div>
</div>

<div id="outline-container-orgd8c5e85" class="outline-3">
<h3 id="orgd8c5e85"><span class="section-number-3">2.9</span> Question 9</h3>
<div class="outline-text-3" id="text-2-9">
<ul class="org-ul">
<li>Q: node.js事件驱动</li>
<li>A:</li>
</ul>
<pre class="example">
消息名(相当于通道)
向一个消息名里抛出消息 emit
从一个消息名里监听消息 once （多种模式）
</pre>
</div>
</div>
<div id="outline-container-org7d6fbf7" class="outline-3">
<h3 id="org7d6fbf7"><span class="section-number-3">2.10</span> Question 10</h3>
<div class="outline-text-3" id="text-2-10">
<ul class="org-ul">
<li>Q: node.js的web后端开发</li>
<li>A:</li>
</ul>
<pre class="example">
学习相关的三方库
http
file
mysql,postgresql
mongodb
</pre>
</div>
</div>
</div>


<div id="outline-container-org7cf1056" class="outline-2">
<h2 id="org7cf1056"><span class="section-number-2">3</span> es6</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
ECMAScript语言规范第6版，规范编写JS代码的方式！
</pre>
</div>
<div id="outline-container-orgb4704cb" class="outline-3">
<h3 id="orgb4704cb"><span class="section-number-3">3.1</span> let 和 const</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>let</li>
</ul>
<pre class="example">
let定义一个变量，并且定义的变量为块级作用域
</pre>

<ul class="org-ul">
<li>const</li>
</ul>
<pre class="example">
const定义一个常量
</pre>

<pre class="example">
// es6_001.js

const pi = 3.1415926;
for (let i = 0; i &lt; 2; i++) {
    console.log("this is for loop i: ", i);
}

console.log("pi: ", pi);

// let声明的i，只是在for作用域中，这里没有定义的变量i报错
console.log("this is not for loop i: ", i);
</pre>

<pre class="example">
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_001.js 
this is for loop i:  0
this is for loop i:  1
pi:  3.1415926
c:\Projects\lescpsn\study\javascript\nodejs\es6\es6_001.js:9
console.log("this is not for loop i: ", i); 
                                        ^

ReferenceError: i is not defined
</pre>
</div>
</div>

<div id="outline-container-orgf1f21e6" class="outline-3">
<h3 id="orgf1f21e6"><span class="section-number-3">3.2</span> for of 直接遍历数组的值</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
let myArry = ['a', 'ab', "b", "bc"];

for (let v of myArry) {
    console.log(v);
}
</pre>

<pre class="example">
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_002.js 
a
ab
b
bc
c/P/l/s/javascript/nodejs/es6:master*? λ
</pre>
</div>
</div>

<div id="outline-container-org1f3a5fb" class="outline-3">
<h3 id="org1f3a5fb"><span class="section-number-3">3.3</span> 函数定义</h3>
<div class="outline-text-3" id="text-3-3">
<pre class="example">
getName: function(name)  ==&gt;     getName(name)
</pre>

<pre class="example">
// es6_003.js

var human = {
    getName(name) { // getName: function(name)
        console.log("my name is: ", name);
    }
};
human.getName('abb');
</pre>
<pre class="example">
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_003.js 
my name is:  abb
c/P/l/s/javascript/nodejs/es6:master*? λ
</pre>
</div>
</div>

<div id="outline-container-org759098b" class="outline-3">
<h3 id="org759098b"><span class="section-number-3">3.4</span> 类定义（class）</h3>
<div class="outline-text-3" id="text-3-4">
<pre class="example">
// es6_004.js

class Human {
    constructor(name) {  // 相当于构造函数
        this.name = name;
    }
    getName(){
        console.log("my name is:",this.name);
    }
}
var man = new Human('bccc');
man.getName();
</pre>
<pre class="example">
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe es6_004.js 
my name is: bccc
c/P/l/s/javascript/nodejs/es6:master*? λ
</pre>
</div>
</div>
