study/nodejs/nodejs.org
** 继承类定义（class，extends）
#+BEGIN_EXAMPLE
// es6_005.js

class Human {
    constructor(name) { // 相当于构造函数
        this.name = name;
    }
    getName() {
        console.log("my name is:", this.name);
    }
}

class Man extends Human {
    constructor(name, sex) { // 相当于构造函数
        super(name); // 继承父类的构造函数
        this.sex = sex;
    }

    info() {
        console.log(this.name, "is", this.sex);
    }
}

var boy = new Man("Jem", "boy");
boy.getName();
boy.info();
#+END_EXAMPLE
#+BEGIN_EXAMPLE
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe es6_005.js 
my name is: Jem
Jem is boy
c/P/l/s/javascript/nodejs/es6:master*? λ 
#+END_EXAMPLE

** 公有导出
#+BEGIN_EXAMPLE
// lib.js
module.exports  ==>  export
export {funct, var, var};

require  ==> import
import {funct, var,var} from "./lib.js"
#+END_EXAMPLE

** 箭头函数
#+BEGIN_EXAMPLE
箭头操作符 => 简化了函数的书写。操作符左边为输入的参数，而右边则是进行的操作以及返回的值
#+END_EXAMPLE
#+BEGIN_EXAMPLE
let arr_a1 = ['a',"ab",1,1.45,['b','bc']];
console.log(arr_a1);
console.log("----------------------------------------");
arr_a1.forEach((item,i) =>console.log(item,i));
console.log("----------------------------------------");
#+END_EXAMPLE


#+BEGIN_EXAMPLE
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_007.js 
[ 'a', 'ab', 1, 1.45, [ 'b', 'bc' ] ]
----------------------------------------
a 0
ab 1
1 2
1.45 3
[ 'b', 'bc' ] 4
----------------------------------------
c/P/l/s/javascript/nodejs/es6:master*? λ 
#+END_EXAMPLE

** 字符串模板
#+BEGIN_EXAMPLE
// es6_008.js

let num = Math.random();
console.log(`random num is ${num}`);  //必须加有{}
console.log(`random num is $num`);
#+END_EXAMPLE

#+BEGIN_EXAMPLE
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_008.js 
random num is 0.8724538604517855
random num is $num
c/P/l/s/javascript/nodejs/es6:master*? λ 
#+END_EXAMPLE

** 解构(函数多返回值)
#+BEGIN_EXAMPLE
如果函数返回多个值，可以直接返回一个数组，数组中的值会自动被解析到对应接收该值的数组变量中。
#+END_EXAMPLE

#+BEGIN_EXAMPLE
// es6_009.js

function getVal() {
    return [1, 'a', "bc"];
}

[va1, va2, va3] = getVal();

[vb1, vb2] = getVal(); // 接受数组的元素个数可以比返回数组的个数少

//['',vc2,vc3] =getVal(); // 如何表示占位符呢？

console.log(va1, va2, va3);
console.log(vb1, vb2);
//console.log(vc2, vc3);
#+END_EXAMPLE

#+BEGIN_EXAMPLE
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_009.js 
1 'a' 'bc'
1 'a'
c/P/l/s/javascript/nodejs/es6:master*? λ 
#+END_EXAMPLE

** 函数参数默认值
#+BEGIN_EXAMPLE
// es6_010.js

function sayHi(name='HanMM') {
    console.log(`Hi ${name}`);

}
sayHi();
sayHi('Tom');

#+END_EXAMPLE

#+BEGIN_EXAMPLE
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_010.js 
Hi HanMM
Hi Tom
c/P/l/s/javascript/nodejs/es6:master*? λ 
#+END_EXAMPLE

** 新增的集合相关类型
+ map set
#+BEGIN_EXAMPLE
// es6_011.js

let s = new Set();
s.add('zhangsan');
s.add(11);
s.add(3.14);

console.log(s);
console.log(s.size);
console.log(s.has(11));
console.log("-----------------------------------");
let m = new Map();
m.set('name','Tom');
m.set('age',32);
console.log(m);
console.log(m.size);
console.log(m.has('age'));
#+END_EXAMPLE

#+BEGIN_EXAMPLE
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_011.js 
Set { 'zhangsan', 11, 3.14 }
3
true
------------------------
Map { 'name' => 'Tom', 'age' => 32 }
2
true
c/P/l/s/javascript/nodejs/es6:master*? λ 
#+END_EXAMPLE

+ WeakSet WeakMap 
#+BEGIN_EXAMPLE
参数只接受对象 , 且不能遍历.
#+END_EXAMPLE

