study/nodejs/nodejs.html

<div id="outline-container-orga0bc933" class="outline-3">
<h3 id="orga0bc933"><span class="section-number-3">3.5</span> 继承类定义（class，extends）</h3>
<div class="outline-text-3" id="text-3-5">
<pre class="example">
// es6_005.js

class Human {
    constructor(name) { // 相当于构造函数
        this.name = name;
    }
    getName() {
        console.log("my name is:", this.name);
    }
}

class Man extends Human {
    constructor(name, sex) { // 相当于构造函数
        super(name); // 继承父类的构造函数
        this.sex = sex;
    }

    info() {
        console.log(this.name, "is", this.sex);
    }
}

var boy = new Man("Jem", "boy");
boy.getName();
boy.info();
</pre>
<pre class="example">
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe es6_005.js 
my name is: Jem
Jem is boy
c/P/l/s/javascript/nodejs/es6:master*? λ
</pre>
</div>
</div>

<div id="outline-container-orgc625d83" class="outline-3">
<h3 id="orgc625d83"><span class="section-number-3">3.6</span> 公有导出</h3>
<div class="outline-text-3" id="text-3-6">
<pre class="example">
// lib.js
module.exports  ==&gt;  export
export {funct, var, var};

require  ==&gt; import
import {funct, var,var} from "./lib.js"
</pre>
</div>
</div>

<div id="outline-container-org8b6d1ab" class="outline-3">
<h3 id="org8b6d1ab"><span class="section-number-3">3.7</span> 箭头函数</h3>
<div class="outline-text-3" id="text-3-7">
<pre class="example">
箭头操作符 =&gt; 简化了函数的书写。操作符左边为输入的参数，而右边则是进行的操作以及返回的值
</pre>
<pre class="example">
let arr_a1 = ['a',"ab",1,1.45,['b','bc']];
console.log(arr_a1);
console.log("----------------------------------------");
arr_a1.forEach((item,i) =&gt;console.log(item,i));
console.log("----------------------------------------");
</pre>


<pre class="example">
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_007.js 
[ 'a', 'ab', 1, 1.45, [ 'b', 'bc' ] ]
----------------------------------------
a 0
ab 1
1 2
1.45 3
[ 'b', 'bc' ] 4
----------------------------------------
c/P/l/s/javascript/nodejs/es6:master*? λ
</pre>
</div>
</div>

<div id="outline-container-org9286aa3" class="outline-3">
<h3 id="org9286aa3"><span class="section-number-3">3.8</span> 字符串模板</h3>
<div class="outline-text-3" id="text-3-8">
<pre class="example">
// es6_008.js

let num = Math.random();
console.log(`random num is ${num}`);  //必须加有{}
console.log(`random num is $num`);
</pre>

<pre class="example">
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_008.js 
random num is 0.8724538604517855
random num is $num
c/P/l/s/javascript/nodejs/es6:master*? λ
</pre>
</div>
</div>

<div id="outline-container-orgb9fc0da" class="outline-3">
<h3 id="orgb9fc0da"><span class="section-number-3">3.9</span> 解构(函数多返回值)</h3>
<div class="outline-text-3" id="text-3-9">
<pre class="example">
如果函数返回多个值，可以直接返回一个数组，数组中的值会自动被解析到对应接收该值的数组变量中。
</pre>

<pre class="example">
// es6_009.js

function getVal() {
    return [1, 'a', "bc"];
}

[va1, va2, va3] = getVal();

[vb1, vb2] = getVal(); // 接受数组的元素个数可以比返回数组的个数少

//['',vc2,vc3] =getVal(); // 如何表示占位符呢？

console.log(va1, va2, va3);
console.log(vb1, vb2);
//console.log(vc2, vc3);
</pre>

<pre class="example">
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_009.js 
1 'a' 'bc'
1 'a'
c/P/l/s/javascript/nodejs/es6:master*? λ
</pre>
</div>
</div>

<div id="outline-container-org9c6c0b5" class="outline-3">
<h3 id="org9c6c0b5"><span class="section-number-3">3.10</span> 函数参数默认值</h3>
<div class="outline-text-3" id="text-3-10">
<pre class="example">
// es6_010.js

function sayHi(name='HanMM') {
    console.log(`Hi ${name}`);

}
sayHi();
sayHi('Tom');
</pre>

<pre class="example">
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_010.js 
Hi HanMM
Hi Tom
c/P/l/s/javascript/nodejs/es6:master*? λ
</pre>
</div>
</div>

<div id="outline-container-orgfc2c97e" class="outline-3">
<h3 id="orgfc2c97e"><span class="section-number-3">3.11</span> 新增的集合相关类型</h3>
<div class="outline-text-3" id="text-3-11">
<ul class="org-ul">
<li>map set</li>
</ul>
<pre class="example">
// es6_011.js

let s = new Set();
s.add('zhangsan');
s.add(11);
s.add(3.14);

console.log(s);
console.log(s.size);
console.log(s.has(11));
console.log("-----------------------------------");
let m = new Map();
m.set('name','Tom');
m.set('age',32);
console.log(m);
console.log(m.size);
console.log(m.has('age'));
</pre>

<pre class="example">
c/P/l/s/javascript/nodejs/es6:master*? λ node.exe  es6_011.js 
Set { 'zhangsan', 11, 3.14 }
3
true
------------------------
Map { 'name' =&gt; 'Tom', 'age' =&gt; 32 }
2
true
c/P/l/s/javascript/nodejs/es6:master*? λ
</pre>

<ul class="org-ul">
<li>WeakSet WeakMap</li>
</ul>
<pre class="example">
参数只接受对象 , 且不能遍历.
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-03-15 周三 21:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
